---
kind: property
id: P:Autodesk.Revit.DB.SpatialElement.SpatialElementType
source: html/a4758761-ca5a-edca-a791-3b90c7f1f9ba.htm
---
# Autodesk.Revit.DB.SpatialElement.SpatialElementType Property

The spatial element type.

## Syntax (C#)
```csharp
public SpatialElementType SpatialElementType { get; }
```